<?php
// Попытка прочитать напрямую отправит в корень.
if (!defined('SESSION_ID')) {
    header('Refresh: 0; url=/error404.html');
}

//------------------------------------------------------------------------------
//	DESCRIPTIONS
//------------------------------------------------------------------------------
/**
 * Файл chat - без описания
 * <br>
 * @author Frolov E. <frolov@amiriset.com>
 * @created 27.02.2020 21:00
 * @project PHP.Chat
 */
//------------------------------------------------------------------------------
//	IMPLEMENTS
//------------------------------------------------------------------------------
?>
<!-- Контент чата (контакт лист + формы). -->            
<div id="content">
    <!-- Компонент контакт лист. -->
    <div id="contact_list">
        <!-- Поиск. -->
        <div id="search"> </div>
        <!-- Список контактов. -->
        <?php WChat\Engine::loadBlock("LeftContactList"); ?>
    </div>
    <!-- Компонент Чат -->
    <div id="chat">
        <!-- Панель сообщений в чате. -->
        <?php WChat\Engine::loadBlock("MessageList"); ?>
        <!-- Панель оправки сообщения в чат. -->
        <div id="controls"></div>
    </div>
</div>