<?php
if (!defined('SESSION_ID')) {
    header('Refresh: 0; url=/error/404');
}
//------------------------------------------------------------------------------
//    ОПИСАНИЕ
//------------------------------------------------------------------------------
/**
 * Файл <b>init.php</b> -- файл общих настроек для проекта.
 */
//------------------------------------------------------------------------------
//	РЕАЛИЗАЦИЯ
//------------------------------------------------------------------------------

/** Разделитель директорий */
define('DS', DIRECTORY_SEPARATOR);

/** Корневая директория */
define('ROOT', '..');

/** Директория движка */
define('ENGINE', 'core');

/** Директория сайта */
define('LOCAL', 'www');