<?php
// Попытка зайти на класс напрямую придется отправить в .. корень =)
if (!defined('SESSION_ID')) {
    header('Refresh: 0; url=/error404.html');
}
//------------------------------------------------------------------------------
//    ОПИСАНИЕ
//------------------------------------------------------------------------------
/**
 * Файл <b>init.php</b> -- файл общих настроек для проекта.
 */
//------------------------------------------------------------------------------
//	РЕАЛИЗАЦИЯ
//------------------------------------------------------------------------------

/** Разделитель директорий */
define('DS', DIRECTORY_SEPARATOR);

/** Корневая директория */
define('ROOT', '..');

/** Директория движка */
define('ENGINE', 'core');

/** Директория сайта */
define('LOCAL', 'www');

/** Директория блоков */
define('BLOCKS', 'blocks');

/** Директория классов */
define('CLASSES', 'classes');

/** Директория шаблонов */
define('TEMPLATES', 'templates');


include_once(ROOT .DS . ENGINE . DS . "Engine.php");